
## Plan Result (parser-graphql-wrapper-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/47226)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod:673" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (1 unchanged element hidden)
                        {
                            name  = "OTLP_COLLECTOR_HOST"
                            value = "localhost"
                        },
                      ~ {
                            name  = "REDIS_PRIMARY_ENDPOINT"
                          ~ value = "parsergraphqlwrapper-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com" -> "parsergraphqlwrapper-prod.zcx42u.ng.0001.use1.cache.amazonaws.com"
                        },
                      ~ {
                            name  = "REDIS_READER_ENDPOINT"
                          ~ value = "parsergraphqlwrapper-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com" -> "parsergraphqlwrapper-prod-ro.zcx42u.ng.0001.use1.cache.amazonaws.com"
                        },
                    ]
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/parsergraphqlwrapper-prod-app:e5485614bf6d16e1b50199fd78fa3c85db4aa7aa" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/parsergraphqlwrapper-prod-app:b7f82e9da97fdd5193ed79ab9573737e07d923ac"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (8 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ParserGraphQLWrapper-Prod" -> (known after apply)
      ~ revision                 = 673 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ParserGraphQLWrapper"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF must be replaced
-/+ resource "aws_elasticache_serverless_cache" "serverless_redis_elasticache_serverless_356B3FAF" {
      ~ arn                      = "arn:aws:elasticache:us-east-1:996905175585:serverlesscache:parsergraphqlwrapper-prod-serverless" -> (known after apply)
      ~ create_time              = "2024-02-12T18:36:05Z" -> (known after apply)
      ~ daily_snapshot_time      = "07:00" -> (known after apply)
      ~ endpoint                 = [
          - {
              - address = "parsergraphqlwrapper-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
              - port    = 6379
            },
        ] -> (known after apply)
      ~ full_engine_version      = "7.1" -> (known after apply)
      ~ id                       = "parsergraphqlwrapper-prod-serverless" -> (known after apply)
      ~ major_engine_version     = "7" -> (known after apply)
      ~ name                     = "parsergraphqlwrapper-prod-serverless" -> "ParserGraphQLWrapper-Prod-serverless" # forces replacement
      ~ reader_endpoint          = [
          - {
              - address = "parsergraphqlwrapper-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
              - port    = 6380
            },
        ] -> (known after apply)
      ~ snapshot_retention_limit = 0 -> (known after apply)
      ~ status                   = "available" -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ParserGraphQLWrapper"
        }
        # (5 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"7bc10908-8307-48bc-afcb-59d511f99421","JobName":"parser-graphql-wrapper_infrastructure_plan_prod","PRNumber":166,"Program":"tfcmt","SHA1":"b7f82e9da97fdd5193ed79ab9573737e07d923ac","Target":"parser-graphql-wrapper-cdk","Vars":{}} -->